ХМНПФ_Общее/Documents/уп_Распоряжение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_Распоряжение</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>уп_ВидДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ВидыДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДокументРегистрации</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уп_ДокументРегистрации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>еКоэф</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидПенсионногоСчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ВидыПенсионныхСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ФормаВвода</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ФормаВвода</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОтражатьВБухгалтерскомУчете</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>еГрДож</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Удалитьуп_ТаблицыДожитий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>еМаксВозраст</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипСуммы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ТипыСумм</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ИзменениеУсловийВыплат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Заявление</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОбновлятьВерсиюПравил</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СписокСчетов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>НомерЛицевогоСчета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ПенсионныеОснования</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уп_ПенсионныеОснованияНПО</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КоличествоВыплат</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>РазмерВыплаты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ВзносыНаИПС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ИДНаУК</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДатаСледующейПеререгистрации</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ПенсионныйДоговор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уп_ПенсионныеДоговоры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>НомерСчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уп_ПенсионныеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Участник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДоверенноеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Получатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>НачальнаяДата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Схема</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уп_ПенсионныеСхемы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ПериодичностьВыплат</Name>
							<Type>
								<v8:Type>cfg:EnumRef.уп_ПериодичностьВыплат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>НомерМесяцаВПериоде</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>РасчетныйСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДатаОкончанияОснований</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ВыделяемаяСумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>НомерОчереди</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ФормаВыплаты</Name>
							<Type>
								<v8:Type>cfg:EnumRef.уп_ФормыВыплаты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ТипЛицевогоСчета</Name>
							<Type>
								<v8:Type>cfg:EnumRef.уп_ТипыЛицевыхСчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ИДНаИПС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СхемаСчетаИсходная</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уп_ПенсионныеСхемы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ВзносыНаУК</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ПерваяВылата</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СправкаОбИнвалидности</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.уп_СправкаОбИнвалидности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>РазмерПервойВыплаты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ПроцентПервойВыплаты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ТипПенсии</Name>
							<Type>
								<v8:Type>cfg:EnumRef.уп_ТипыПенсионныхСхем</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

ХМНПФ_Общее/InformationRegisters/уп_СхемаСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_СхемаСчета</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Схема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеСхемы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипПенсии</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ТипыПенсионныхСхем</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ХМНПФ_Общее/InformationRegisters/уп_КоличествоНазначенныхВыплат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_КоличествоНазначенныхВыплат</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КоличествоВыплат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ХМНПФ_Общее/Documents/уп_Распоряжение/Ext/ObjectModule.bsl
Процедура ХМ_НеТиповыеИзменения()
	// ХМНПФ+ 22.08.2016 ШадринАВ // длина номера изменена с 8 до 27 // №459
	// ХМНПФ 10.02.2017 ШадринАВ // Новая ХМ_ЗАГРУЗКА_ОбработкаПроведения() // №779
	// ХМНПФ 10.02.2017 ШадринАВ // ОбработкаПроведения() // №809
	// ХМНПФ 14.11.2019 ХлопцевБА // является основанием для ввода документа уп_ПеремещениеПенсионныхРезервов // №2510
КонецПроцедуры

// ХМНПФ 10.02.2017 ШадринАВ // Новая ХМ_ЗАГРУЗКА_ОбработкаПроведения() // №779
Процедура ХМ_ЗАГРУЗКА_ОбработкаПроведения(Отказ, Режим, СтрокаТЗ, СтруктураТЧ) Экспорт
	ЭтотОбъект.ОбменДанными.Загрузка = Ложь;
	ЭтотОбъект.Записать(?(ПРОВЕДЕН,РежимЗаписиДокумента.Проведение,РежимЗаписиДокумента.ОтменаПроведения));
	ЭтотОбъект.ОбменДанными.Загрузка = Истина;
КонецПроцедуры


 // ХМНПФ+ 24.01.2024 РустановаСР // изменение даты установки схемы // №3752
&После("ОбработкаПроведения")
Процедура РасшОбщ_ОбработкаПроведения(Отказ, Режим)
	ДвиженияСхема = РегистрыСведений.уп_СхемаСчета.СоздатьНаборЗаписей();
	ДвиженияСхема.Отбор.Регистратор.Установить(Ссылка);
	ДвиженияСхема.Прочитать();
	Для Каждого Стр Из ДвиженияСхема Цикл
		Стр.Период = Дата;
	КонецЦикла;  
	ДвиженияСхема.Записать(); 
	
	Если Отказ = Истина Тогда
		Возврат;
	КонецЕсли; 
	
	Если РольДоступна("хм_СпециалистНПООперОтдел") Тогда
		Отказ = Истина;
	Иначе	
		Документы.уп_Распоряжение.уп_РаспоряжениеОбработкаПроведения(ЭтотОбъект, Отказ, Режим);
	КонецЕсли;	

КонецПроцедуры

&ИзменениеИКонтроль("ПередЗаписью")
Процедура ХМПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	//расчет размеров выплат для строк с незаполненным размером

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	уп_РаспоряжениеСписокСчетов.НомерСчета КАК НомерСчета,
	|	уп_РаспоряжениеСписокСчетов.ВзносыНаИПС КАК ВзносыНаИПС,
	|	уп_РаспоряжениеСписокСчетов.ВзносыНаУК КАК ВзносыНаУК,
	|	уп_РаспоряжениеСписокСчетов.ИДНаИПС КАК ИДНаИПС,
	|	уп_РаспоряжениеСписокСчетов.ИДНаУК КАК ИДНаУК,
	|	уп_РаспоряжениеСписокСчетов.КоличествоВыплат КАК КоличествоВыплат,
	|	уп_РаспоряжениеСписокСчетов.РазмерВыплаты КАК РазмерВыплаты,
	|	уп_РаспоряжениеСписокСчетов.Схема КАК Схема,
	|	уп_РаспоряжениеСписокСчетов.ТипПенсии КАК ТипПенсии,
	|	уп_РаспоряжениеСписокСчетов.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ ВТ_ПСДляРасчета
	|ИЗ
	|	&ТабСчетов КАК уп_РаспоряжениеСписокСчетов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПСДляРасчета.НомерСчета КАК НомерСчета,
	|	ВТ_ПСДляРасчета.ВзносыНаИПС + ВТ_ПСДляРасчета.ВзносыНаУК + ВТ_ПСДляРасчета.ИДНаИПС + ВТ_ПСДляРасчета.ИДНаУК КАК СуммаНаСчете,
	|	ВТ_ПСДляРасчета.КоличествоВыплат КАК КоличествоВыплат,
	|	ВТ_ПСДляРасчета.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ ПСДляРасчета
	|ИЗ
	|	ВТ_ПСДляРасчета КАК ВТ_ПСДляРасчета
	|ГДЕ
	|	(ВТ_ПСДляРасчета.Схема.ТипПенсионнойСхемы = &СрочныйВыплат
	|			ИЛИ ВТ_ПСДляРасчета.ТипПенсии = &СрочныйВыплат)
	|	И ВТ_ПСДляРасчета.Схема.ФиксированныеВыплаты = ЛОЖЬ
	|	И ВТ_ПСДляРасчета.РазмерВыплаты = 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	уп_РегистрацияДоплатДоплаты.НомерСчета КАК НомерСчета,
	|	уп_РегистрацияДоплатДоплаты.РазмерДоплаты * уп_РегистрацияДоплатДоплаты.КоличествоВыплатДоплаты КАК Доплата
	|ПОМЕСТИТЬ СписокДоплат
	|ИЗ
	|	Документ.уп_РегистрацияДоплат.Доплаты КАК уп_РегистрацияДоплатДоплаты
	|ГДЕ
	|	уп_РегистрацияДоплатДоплаты.НомерСчета В
	|			(ВЫБРАТЬ
	|				ПСДляРасчета.НомерСчета
	|			ИЗ
	|				ПСДляРасчета)
	|	И уп_РегистрацияДоплатДоплаты.Ссылка.ПометкаУдаления = ЛОЖЬ
	|	И уп_РегистрацияДоплатДоплаты.Ссылка.Дата МЕЖДУ &Дата1 И &Дата2
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	уп_КоличествоНазначенныхВыплат.НомерСчета КАК НомерСчета,
	|	МАКСИМУМ(уп_КоличествоНазначенныхВыплат.Период) КАК Период
	|ПОМЕСТИТЬ ДатыНазначенногоКоличества
	|ИЗ
	|	РегистрСведений.уп_КоличествоНазначенныхВыплат КАК уп_КоличествоНазначенныхВыплат
	|ГДЕ
	|	уп_КоличествоНазначенныхВыплат.Период < &Дата1
	|	И уп_КоличествоНазначенныхВыплат.Регистратор <> &Ссылка
	|	И уп_КоличествоНазначенныхВыплат.НомерСчета В
	|			(ВЫБРАТЬ
	|				ПСДляРасчета.НомерСчета
	|			ИЗ
	|				ПСДляРасчета)
	|
	|СГРУППИРОВАТЬ ПО
	|	уп_КоличествоНазначенныхВыплат.НомерСчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДатыНазначенногоКоличества.НомерСчета КАК НомерСчета,
	|	уп_КоличествоНазначенныхВыплат.КоличествоВыплат КАК КоличествоВыплат
	|ПОМЕСТИТЬ КоличествоНазначенноеДо
	|ИЗ
	|	ДатыНазначенногоКоличества КАК ДатыНазначенногоКоличества
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уп_КоличествоНазначенныхВыплат КАК уп_КоличествоНазначенныхВыплат
	|		ПО ДатыНазначенногоКоличества.НомерСчета = уп_КоличествоНазначенныхВыплат.НомерСчета
	|			И ДатыНазначенногоКоличества.Период = уп_КоличествоНазначенныхВыплат.Период
	|ГДЕ
	|	уп_КоличествоНазначенныхВыплат.НомерСчета В
	|			(ВЫБРАТЬ
	|				ПСДляРасчета.НомерСчета
	|			ИЗ
	|				ПСДляРасчета)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	уп_СчетчикНачисленийОбороты.НомерСчета КАК НомерСчета,
	|	уп_СчетчикНачисленийОбороты.КоличествоОборот КАК КоличествоНачислений
	|ПОМЕСТИТЬ КоличествоНачисленное
	|ИЗ
#Вставка
//++https://redmine.npf.com/issues/4274
	|		(ВЫБРАТЬ уп_СчетчикНачислений.НомерСчета, Максимум(естьNUll(хм_СрезСчетчик.Количество,0)) + СУММА(ВЫБОР КОГДА хм_СрезСчетчик.ДатаУстановкиСостояния есть NUll Тогда естьNUll(уп_СчетчикНачислений.Количество,0) ИНАЧЕ 0 КОНЕЦ) КАК КоличествоОборот
	|		ИЗ РегистрНакопления.уп_СчетчикНачислений КАК уп_СчетчикНачислений
	|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрСведений.хм_СрезСчетчикНачисленийНПО.СрезПоследних(&ДатаДок,НомерСчета В (ВЫБРАТЬ
	|					ПСДляРасчета.НомерСчета
	|				ИЗ
	|					ПСДляРасчета)) КАК хм_СрезСчетчик
	|		ПО (уп_СчетчикНачислений.НомерСчета = хм_СрезСчетчик.НомерСчета)
	|			И уп_СчетчикНачислений.Период < хм_СрезСчетчик.ДатаУстановкиСостояния 
	|			И хм_СрезСчетчик.ДатаУстановкиСостояния  >= &ДатаНачалаВремен	
	|		ГДЕ уп_СчетчикНачислений.Период <= &ДатаДок 
	|			И уп_СчетчикНачислений.Период >= &ДатаНачалаВремен
	|			И уп_СчетчикНачислений.НомерСчета В (ВЫБРАТЬ
	|					ПСДляРасчета.НомерСчета
	|				ИЗ
	|					ПСДляРасчета)
	|		СГРУППИРОВАТЬ ПО уп_СчетчикНачислений.НомерСчета
	|		) КАК уп_СчетчикНачисленийОбороты
	|ИНДЕКСИРОВАТЬ ПО
	|	НомерСчета
//--https://redmine.npf.com/issues/4274
#КонецВставки
#Удаление
	|	РегистрНакопления.уп_СчетчикНачислений.Обороты(
	|			&ДатаНачалаВремен,
	|			&ДатаДок,
	|			Период,
	|			НомерСчета В
	|				(ВЫБРАТЬ
	|					ПСДляРасчета.НомерСчета
	|				ИЗ
	|					ПСДляРасчета)) КАК уп_СчетчикНачисленийОбороты
#КонецУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПСДляРасчета.НомерСчета КАК НомерСчета,
	|	ПСДляРасчета.СуммаНаСчете КАК СуммаНаСчете,
	|	ПСДляРасчета.КоличествоВыплат + ЕСТЬNULL(КоличествоНачисленное.КоличествоНачислений, 0) КАК КоличествоНазначенныхВыплат,
	|	ПСДляРасчета.НомерСтроки КАК НомерСтроки,
	|	ЕСТЬNULL(СписокДоплат.Доплата, 0) КАК Доплата,
	|	ЕСТЬNULL(КоличествоНачисленное.КоличествоНачислений, 0) КАК КоличествоНачислений,
	|	ЕСТЬNULL(КоличествоНазначенноеДо.КоличествоВыплат, 0) КАК КоличествоНазначеноДо
	|ИЗ
	|	ПСДляРасчета КАК ПСДляРасчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ СписокДоплат КАК СписокДоплат
	|		ПО ПСДляРасчета.НомерСчета = СписокДоплат.НомерСчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ КоличествоНазначенноеДо КАК КоличествоНазначенноеДо
	|		ПО ПСДляРасчета.НомерСчета = КоличествоНазначенноеДо.НомерСчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ КоличествоНачисленное КАК КоличествоНачисленное
	|		ПО ПСДляРасчета.НомерСчета = КоличествоНачисленное.НомерСчета";

	Запрос.УстановитьПараметр("Дата1", НачалоДня(Дата));
	Запрос.УстановитьПараметр("Дата2", КонецДня(Дата));
	Запрос.УстановитьПараметр("ДатаДок", Дата);
	Запрос.УстановитьПараметр("ДатаНачалаВремен", '19800101');
	Запрос.УстановитьПараметр("СрочныйВыплат", Перечисления.уп_ТипыПенсионныхСхем.СрочныхВыплат);
	Запрос.УстановитьПараметр("ТабСчетов", СписокСчетов.Выгрузить());
	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		НастройкаОпределенияКоличестваВыплат = РегистрыСведений.уп_ПенсионныеПравила.ПолучитьПоследнее(Дата, Новый Структура("Организация", Организация)).ОпределениеКоличестваВыплат;

		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если НастройкаОпределенияКоличестваВыплат Тогда
				КоличествоНазначенныхВыплат = ВыборкаДетальныеЗаписи.КоличествоНазначенныхВыплат;
			Иначе
				УжеНазначено = ВыборкаДетальныеЗаписи.КоличествоНазначеноДо;
				КоличествоНазначенныхВыплат = УжеНазначено + ВыборкаДетальныеЗаписи.КоличествоНазначенныхВыплат;

			КонецЕсли;
			Если КоличествоНазначенныхВыплат<>0 Тогда
				РазмерПенсии = (ВыборкаДетальныеЗаписи.СуммаНаСчете-ВыборкаДетальныеЗаписи.Доплата)/КоличествоНазначенныхВыплат;
				СтруктураОтбора = Новый Структура;
				СтруктураОтбора.Вставить("НомерСчета",     ВыборкаДетальныеЗаписи.НомерСчета);
				СтрокаТабличнойЧасти = уп_ОсновнаяПоставкаСервер.НайтиСтрокуТабЧасти(СписокСчетов, СтруктураОтбора);
				СтрокаТабличнойЧасти.РазмерВыплаты = РазмерПенсии;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

&ИзменениеИКонтроль("ОбработкаПроведения")
Процедура ХМОбработкаПроведения(Отказ, Режим)
	
	Перем СтруктураШапкиДокумента;
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = ОбщегоНазначенияБПВызовСервера.ПредставлениеДокументаПриПроведении(Ссылка);

	// Проверка ручной корректировки
	Если уп_ОсновнаяПоставкаСервер.РучнаяКорректировкаОбработкаПроведения(РучнаяКорректировка,Отказ,Заголовок,ЭтотОбъект,Ложь) Тогда
		Возврат
	КонецЕсли;
	МассивСообщений = Новый СписокЗначений;
	ПодготовитьСтруктуруШапкиДокумента(Заголовок, СтруктураШапкиДокумента, Отказ);
	ПроверитьЗаполнениеДокумента(Отказ, Заголовок, СтруктураШапкиДокумента,МассивСообщений);
	//выясним надо ли начислять за весь период
	СрезПенсионныхПравил = РегистрыСведений.уп_ПенсионныеПравила.ПолучитьПоследнее(Дата, Новый Структура("Организация", Организация));
	ПолныйПериод = СрезПенсионныхПравил.ВсегдаНачислятьЗаПолныйПериод;
	ВестиУчетПСпоТипамДоговоровЕПС = СрезПенсионныхПравил.ВестиУчетПСпоТипамДоговоровЕПС;
	ДатаНачалаВеденияУчетаПоСхемам = Константы.уп_УчетРезерваНПОвРазрезеСхем.Получить();
	Если ЗначениеЗаполнено(ДатаНачалаВеденияУчетаПоСхемам) И ДатаНачалаВеденияУчетаПоСхемам<=Дата Тогда
		ВестиУчетПоСхемам = Истина;
	Иначе
		ВестиУчетПоСхемам = Ложь;
	КонецЕсли;	
		
	ТабБухУчет = уп_ОбщегоНазначенияУчетРезервов.СформироватьСтруктуруТаблицыБУ();
	
	//ОПА НПО 2018.04.28 +
	ТаблицаСчетов = Новый ТаблицаЗначений;
	ТаблицаСчетов.Колонки.Добавить("НомерСчета",Новый ОписаниеТипов("СправочникСсылка.уп_ПенсионныеСчета"));
	ТаблицаСчетов.Колонки.Добавить("ТипПССписания",Новый ОписаниеТипов("ПеречислениеСсылка.нфо_ТипДоговораНПФ"));
	ТаблицаСчетов.Колонки.Добавить("ТипПСЗачисления",Новый ОписаниеТипов("ПеречислениеСсылка.нфо_ТипДоговораНПФ"));
	ТаблицаСчетов.Колонки.Добавить("СхемаСписания",Новый ОписаниеТипов("СправочникСсылка.уп_ПенсионныеСхемы"));
	ТаблицаСчетов.Колонки.Добавить("СхемаЗачисления",Новый ОписаниеТипов("СправочникСсылка.уп_ПенсионныеСхемы"));
	ТаблицаСчетов.Колонки.Добавить("ТипПенсии",Новый ОписаниеТипов("ПеречислениеСсылка.уп_ТипыПенсионныхСхем"));
	//ОПА НПО 2018.04.28 -
	//ОПА НПО 2018.06.14 +
	ЗависимостьМесяцаВыплаты = РегистрыСведений.уп_ПенсионныеПравила.ПолучитьПоследнее(Дата, Новый Структура("Организация", Организация)).ЗависимостьМесяцаВыплатыНПО;
	Если НЕ ЗначениеЗаполнено(ЗависимостьМесяцаВыплаты) Тогда
		ЗависимостьМесяцаВыплаты = Перечисления.уп_ЗависимостьМесяцаВыплатыНПО.НеЗависит;
	КонецЕсли;	
	//ОПА НПО 2018.06.14 -
	//ОПА НПО 2018.07.03 +
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	уп_ПараметрыПенсионногоДоговораСрезПоследних.ПенсионныйДоговор КАК ПенсионныйДоговор,
		|	уп_ПараметрыПенсионногоДоговораСрезПоследних.ШаблонДоговора КАК ШаблонДоговора
		|ИЗ
		|	РегистрСведений.уп_ПараметрыПенсионногоДоговора.СрезПоследних(&ДатаДок, ПенсионныйДоговор В (&Договоры)) КАК уп_ПараметрыПенсионногоДоговораСрезПоследних";
	
	Запрос.УстановитьПараметр("ДатаДок", Дата);
	Запрос.УстановитьПараметр("Договоры", СписокСчетов.ВыгрузитьКолонку("ПенсионныйДоговор"));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Шаблоны = Новый Соответствие; 
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Шаблоны.Вставить(ВыборкаДетальныеЗаписи.ПенсионныйДоговор, ВыборкаДетальныеЗаписи.ШаблонДоговора); 
	КонецЦикла;  
	
	//дополним таблицу версиями 
	Запрос = Новый Запрос;
	Запрос.Текст = ПолучитьДанныеТЧСДополнениями();
	Запрос.УстановитьПараметр("ссылка", ссылка);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ДатаДок", Дата);
	Запрос.УстановитьПараметр("ДатаДоДок", Дата-1); 
	
	Результат = Запрос.Выполнить(); 
	ТекСтрокаСписокСчетов = Результат.Выбрать();    
	
	ТаблицаВыплатССПС = Новый СписокЗначений;
	
	//Для Каждого ТекСтрокаСписокСчетов Из СписокСчетов Цикл 
	Пока ТекСтрокаСписокСчетов.Следующий() Цикл
		//Проверки
		Если Не ЗначениеЗаполнено(ТекСтрокаСписокСчетов.НомерСчета) Тогда
			уп_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("По строке "+ТекСтрокаСписокСчетов.НомерСтроки+" не выбран пенсионный счет.",,Заголовок);
			Отказ = Истина;
		КонецЕсли;	
		
		//схему
		Если Не ЗначениеЗаполнено(ТекСтрокаСписокСчетов.Схема) Тогда
			уп_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("По строке "+ТекСтрокаСписокСчетов.НомерСтроки+" не указана пенсионная схема.",,Заголовок);
			МассивСообщений.Добавить("По строке "+ТекСтрокаСписокСчетов.НомерСтроки+" не указана пенсионная схема.");
		Иначе
			//если пожизненная или с фиксированной выплатой, то должен быть заполнен размер
			Если  ТекСтрокаСписокСчетов.Схема.ТипПенсионнойСхемы = Перечисления.уп_ТипыПенсионныхСхем.ДоИсчерпанияСредствНаСчете
				или ТекСтрокаСписокСчетов.Схема.ТипПенсионнойСхемы = Перечисления.уп_ТипыПенсионныхСхем.ПожизненныхВыплат 
				или ТекСтрокаСписокСчетов.ТипПенсии = Перечисления.уп_ТипыПенсионныхСхем.ПожизненныхВыплат Тогда
				Если  НЕ ЗначениеЗаполнено(ТекСтрокаСписокСчетов.РазмерВыплаты) Тогда
					уп_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("По строке "+ТекСтрокаСписокСчетов.НомерСтроки+" не указан размер выплат.",,Заголовок);
			        Отказ = Истина;
				КонецЕсли;
				//если срочная, то должен быть заполнен срок
			ИначеЕсли ТекСтрокаСписокСчетов.Схема.ТипПенсионнойСхемы = Перечисления.уп_ТипыПенсионныхСхем.СрочныхВыплат 
				или ТекСтрокаСписокСчетов.ТипПенсии = Перечисления.уп_ТипыПенсионныхСхем.СрочныхВыплат Тогда
				Если  НЕ ЗначениеЗаполнено(ТекСтрокаСписокСчетов.КоличествоВыплат) Тогда
					уп_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("По строке "+ТекСтрокаСписокСчетов.НомерСтроки+" не указано количество выплат.",,Заголовок);
			        Отказ = Истина;
				КонецЕсли;
			КонецЕсли;	
		КонецЕсли;
		
		Если ЗависимостьМесяцаВыплаты <> Перечисления.уп_ЗависимостьМесяцаВыплатыНПО.НеЗависит Тогда
			Если Не ЗначениеЗаполнено(ТекСтрокаСписокСчетов.НомерМесяцаВПериоде) Тогда
				уп_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("По строке "+ТекСтрокаСписокСчетов.НомерСтроки+" не указан номер месяца выплат.",,Заголовок);
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
		
		Если Отказ Тогда
			Возврат
		КонецЕсли;	
		
		// регистр СостоянияПС 
		Движение = Движения.уп_СостоянияПС.Добавить();
		Движение.Период = ?(Дата>ТекСтрокаСписокСчетов.НачальнаяДата,Дата,ТекСтрокаСписокСчетов.НачальнаяДата);
		Движение.ДатаУстановкиСостояния = ТекСтрокаСписокСчетов.НачальнаяДата;
		Движение.НомерСчета = ТекСтрокаСписокСчетов.НомерСчета.Ссылка;
		Движение.Состояние = Перечисления.уп_СостоянияПС.ВыплатнойПериод;
		Движение.Основание = ТекСтрокаСписокСчетов.ПенсионныеОснования;
		Движение.ДатаОкончанияОснований = ТекСтрокаСписокСчетов.ДатаОкончанияОснований;
		
		// регистр РазмерПенсии
		Если  ТекСтрокаСписокСчетов.РазмерВыплаты<>0 Тогда
			Если ПолныйПериод Тогда
				ДатаНачПериода = ТекСтрокаСписокСчетов.НачальнаяДата;
			Иначе
				ДатаНачПериода = уп_НПФ.ОпределитьДатуНачалаПериода(ТекСтрокаСписокСчетов.НачальнаяДата,ТекСтрокаСписокСчетов.ПериодичностьВыплат);
			КонецЕсли;
			Если ТекСтрокаСписокСчетов.НачальнаяДата = ДатаНачПериода Тогда
				Движение = Движения.уп_РазмерПенсии.Добавить();
				Движение.Период = ТекСтрокаСписокСчетов.НачальнаяДата;
				Движение.НомерСчета = ТекСтрокаСписокСчетов.НомерСчета.Ссылка;
				Движение.Размер = ТекСтрокаСписокСчетов.РазмерВыплаты;
				Движение.ПолныйРазмер = ТекСтрокаСписокСчетов.РазмерВыплаты;
			Иначе
				ДатаКонПериода = уп_НПФ.ОпределитьДатуКонцаПериода(ТекСтрокаСписокСчетов.НачальнаяДата,ТекСтрокаСписокСчетов.ПериодичностьВыплат);
				ДоКонцаПериода = ДатаКонПериода-ТекСтрокаСписокСчетов.НачальнаяДата+1;
				СуммаВПервомПериоде = ТекСтрокаСписокСчетов.РазмерВыплаты*ДоКонцаПериода/(ДатаКонПериода-ДатаНачПериода+1);
				Движение = Движения.уп_РазмерПенсии.Добавить();
				Движение.Период = ТекСтрокаСписокСчетов.НачальнаяДата;
				Движение.НомерСчета = ТекСтрокаСписокСчетов.НомерСчета.Ссылка;
				Движение.Размер = СуммавПервомПериоде;  
				Движение.ПолныйРазмер = ТекСтрокаСписокСчетов.РазмерВыплаты;
				
				Движение = Движения.уп_РазмерПенсии.Добавить();
				Движение.Период = ДатаКонПериода+1;
				Движение.НомерСчета = ТекСтрокаСписокСчетов.НомерСчета.Ссылка;
				Движение.Размер = ТекСтрокаСписокСчетов.РазмерВыплаты; 
				Движение.ПолныйРазмер = ТекСтрокаСписокСчетов.РазмерВыплаты;
			КонецЕсли;
		КонецЕсли;
		
		// регистр ПериодичностьВыплат 
		Движение = Движения.уп_ПериодичностьВыплат.Добавить();
		Движение.Период = ТекСтрокаСписокСчетов.НачальнаяДата;
		Движение.НомерСчета = ТекСтрокаСписокСчетов.НомерСчета.Ссылка;
		Движение.ПериодичностьВыплат = ТекСтрокаСписокСчетов.ПериодичностьВыплат;
		Если ЗависимостьМесяцаВыплаты = Перечисления.уп_ЗависимостьМесяцаВыплатыНПО.НеЗависит 
			и НЕ ЗначениеЗаполнено(ТекСтрокаСписокСчетов.НомерМесяцаВПериоде) Тогда
			Движение.НомерМесяцаВПериоде = 1;
		Иначе
			//ОПА НПО 2018.06.14 +
			Движение.НомерМесяцаВПериоде = ТекСтрокаСписокСчетов.НомерМесяцаВПериоде;
			//ОПА НПО 2018.06.14 -
		КонецЕсли;
		
		//регистр Схемы
		Движение = Движения.уп_СхемаСчета.Добавить();
		Движение.Период = Макс(ТекСтрокаСписокСчетов.НачальнаяДата, Дата);
		Движение.НомерСчета = ТекСтрокаСписокСчетов.НомерСчета.Ссылка;
		Движение.Схема = ТекСтрокаСписокСчетов.Схема;
		Если  ТекСтрокаСписокСчетов.Схема.ТипПенсионнойСхемы = Перечисления.уп_ТипыПенсионныхСхем.Смешанная Тогда
			Движение.ТипПенсии = ТекСтрокаСписокСчетов.ТипПенсии;
		Иначе
			Движение.ТипПенсии = ТекСтрокаСписокСчетов.Схема.ТипПенсионнойСхемы;
		КонецЕсли;
		Если ТекСтрокаСписокСчетов.Схема = ТекСтрокаСписокСчетов.СхемаСчетаИсходная Тогда
			ТекВерсияПравил = ТекСтрокаСписокСчетов.ВерсияПенсионныхПравилВходящая;
		ИначеЕсли ОбновлятьВерсиюПравил или Константы.уп_ПорядокВеденияВерсийПенсионныхПравил.Получить() = 0 Тогда
			ТекВерсияПравил = ТекСтрокаСписокСчетов.ВерсияПенсионныхПравилТекущая;
		Иначе
			ТекВерсияПравил = ТекСтрокаСписокСчетов.ВерсияПенсионныхПравилВходящая;
		КонецЕсли;
		Движение.ВерсияПенсионныхПравил = ТекВерсияПравил;
	
		//регистр НомераОчередей
		Движение = Движения.уп_НомераОчередей.Добавить();
		Движение.Период = ТекСтрокаСписокСчетов.НачальнаяДата;
		Движение.НомерСчета = ТекСтрокаСписокСчетов.НомерСчета.Ссылка;
		Движение.НомерОчереди = ТекСтрокаСписокСчетов.НомерОчереди;
		
		//регистр ЛицевыеСчета 
		Если ЗначениеЗаполнено(ТекСтрокаСписокСчетов.ФормаВыплаты) Тогда
			Движение = Движения.уп_ЛицевыеСчетаУчастников.Добавить();
			Движение.Период = ТекСтрокаСписокСчетов.НачальнаяДата;
			Движение.Организация = Организация;
			Движение.НомерСчета = ТекСтрокаСписокСчетов.НомерСчета;
			Движение.Участник = ТекСтрокаСписокСчетов.НомерСчета.Участник;
			Движение.ТипЛицевогоСчета = ТекСтрокаСписокСчетов.ТипЛицевогоСчета;
			Движение.НомерЛицевогоСчета = ТекСтрокаСписокСчетов.НомерЛицевогоСчета;
			Если НЕ ЗначениеЗаполнено(ТекСтрокаСписокСчетов.Получатель) Тогда
				Движение.Банк = Справочники.Контрагенты.ПустаяСсылка();
			Иначе
				Движение.Банк = ТекСтрокаСписокСчетов.Получатель;
				Движение.РасчетныйСчет = ТекСтрокаСписокСчетов.РасчетныйСчет;
			КонецЕсли;
			Движение.ФормаВыплаты = ТекСтрокаСписокСчетов.ФормаВыплаты;
		КонецЕсли;
		
		//доверенные лица
		//Если ЗначениеЗаполнено(ТекСтрокаСписокСчетов.ДоверенноеЛицо) Тогда
			//Движение = Движения.уп_ДоверенныеЛицаУчастников.Добавить();
			//Движение.Период = ТекСтрокаСписокСчетов.НачальнаяДата;
			//Движение.Участник = ТекСтрокаСписокСчетов.НомерСчета.Участник;
			//Движение.ДоверенноеЛицо = ТекСтрокаСписокСчетов.ДоверенноеЛицо;
		//КонецЕсли;
		
		//если ПС личного договора и меняется схема, то надо ее и в договоре сменить
		Если ТекСтрокаСписокСчетов.НомерСчета = ТекСтрокаСписокСчетов.ПенсионныйДоговор.ПенсионныйСчет
			И  ТекСтрокаСписокСчетов.Схема<>ТекСтрокаСписокСчетов.СхемаСчетаИсходная Тогда
			ПенсДоговорОбъект = ТекСтрокаСписокСчетов.ПенсионныйДоговор.ПолучитьОбъект();
			ПенсДоговорОбъект.Схема = ТекСтрокаСписокСчетов.Схема;
			ПенсДоговорОбъект.Записать();
			
			//еще параметры договора
			Движение = Движения.уп_ПараметрыПенсионногоДоговора.Добавить();
			Движение.Период = Дата;
			Движение.ПенсионныйДоговор = ТекСтрокаСписокСчетов.ПенсионныйДоговор;
			Движение.ШаблонДоговора = Шаблоны[ТекСтрокаСписокСчетов.ПенсионныйДоговор];
			Движение.Схема = ТекСтрокаСписокСчетов.Схема; 
			Движение.ВерсияПенсионныхПравил = ТекВерсияПравил;
		КонецЕсли;
		Если ЗначениеЗаполнено(ТекСтрокаСписокСчетов.ДатаСледующейПеререгистрации) Тогда
			Движение = Движения.уп_СрокиПеререгистрации.Добавить();
			Движение.Период = Дата;
			Движение.НомерСчета = ТекСтрокаСписокСчетов.НомерСчета;
			Движение.ДатаСледующейПеререгистрации = ТекСтрокаСписокСчетов.ДатаСледующейПеререгистрации;
		КонецЕсли;
		//ОПА НПО 2018.06.14 +
		//регистр ДатыСледующихВыплат
		Движение = Движения.уп_ДатыСледующихВыплат.Добавить();
		Движение.НомерСчета = ТекСтрокаСписокСчетов.НомерСчета;
		Движение.Период = Дата;
		Если ЗависимостьМесяцаВыплаты = Перечисления.уп_ЗависимостьМесяцаВыплатыНПО.НеЗависит Тогда
			лДата = Макс(ТекСтрокаСписокСчетов.НачальнаяДата, Дата);
		Иначе
			Если ЗависимостьМесяцаВыплаты = Перечисления.уп_ЗависимостьМесяцаВыплатыНПО.ОтДатыНазначения Тогда
				лДата = Дата;
			ИначеЕсли ЗависимостьМесяцаВыплаты = Перечисления.уп_ЗависимостьМесяцаВыплатыНПО.ОтДатыНачалаВыплат Тогда
				лДата = ТекСтрокаСписокСчетов.НачальнаяДата;
			КонецЕсли;
		КонецЕсли;
		ДанныеОчереди = РегистрыСведений.уп_ДатыОчередей.Получить(Новый Структура("НомерОчереди", ТекСтрокаСписокСчетов.НомерОчереди));
		Если ЗначениеЗаполнено(ДанныеОчереди.ДатаВМесяце) Тогда
			лДатаСледующейВыплаты = Дата(Число(Формат(лДата,"ДФ=yyyy")), Число(Формат(лДата,"ДФ=MM")), ДанныеОчереди.ДатаВМесяце);
		Иначе	
			лДатаСледующейВыплаты = Дата(Число(Формат(лДата,"ДФ=yyyy")), Число(Формат(лДата,"ДФ=MM")), Число(Формат(лДата,"ДФ=dd")));
		КонецЕсли;
		Движение.ДатаСледующейВыплаты = лДатаСледующейВыплаты;
		
		//регистр ДатыОкончанияСрочныхВыплат
		//определяем на основании даты начала выплат
		Если ТекСтрокаСписокСчетов.Схема.ТипПенсионнойСхемы = Перечисления.уп_ТипыПенсионныхСхем.СрочныхВыплат 
			или ТекСтрокаСписокСчетов.ТипПенсии = Перечисления.уп_ТипыПенсионныхСхем.СрочныхВыплат Тогда
			Движение = Движения.уп_ДатыОкончанияСрочнойВыплаты.Добавить();
			Движение.НомерСчета = ТекСтрокаСписокСчетов.НомерСчета;
			Движение.Период = Дата;
			Если ТекСтрокаСписокСчетов.ПериодичностьВыплат = Перечисления.уп_ПериодичностьВыплат.Ежегодно Тогда
				лДатаОкончанияСрочнойВыплаты = ДобавитьМесяц(НачалоМесяца(ТекСтрокаСписокСчетов.НачальнаяДата),ТекСтрокаСписокСчетов.КоличествоВыплат*12)-1;	
			ИначеЕсли ТекСтрокаСписокСчетов.ПериодичностьВыплат = Перечисления.уп_ПериодичностьВыплат.Полугодие Тогда
				//лМесяцНачальнаяДата = Число(Формат(НачалоМесяца(ТекСтрокаСписокСчетов.НачальнаяДата),"ДФ=MM"));
				//Если лМесяцНачальнаяДата <= 6 Тогда
				//	лДатаОкончанияСрочнойВыплаты = ДобавитьМесяц(НачалоГода(ТекСтрокаСписокСчетов.НачальнаяДата),ТекСтрокаСписокСчетов.КоличествоВыплат*6)-1;
				//Иначе
				//	лДатаОкончанияСрочнойВыплаты = ДобавитьМесяц(Дата(Год(ТекСтрокаСписокСчетов.НачальнаяДата),7,1),ТекСтрокаСписокСчетов.КоличествоВыплат*6)-1;
				//КонецЕсли;
				лДатаОкончанияСрочнойВыплаты = ДобавитьМесяц(НачалоМесяца(ТекСтрокаСписокСчетов.НачальнаяДата),ТекСтрокаСписокСчетов.КоличествоВыплат*6)-1;
			ИначеЕсли ТекСтрокаСписокСчетов.ПериодичностьВыплат = Перечисления.уп_ПериодичностьВыплат.Ежеквартально Тогда
				лДатаОкончанияСрочнойВыплаты = ДобавитьМесяц(НачалоМесяца(ТекСтрокаСписокСчетов.НачальнаяДата),ТекСтрокаСписокСчетов.КоличествоВыплат*3)-1;	
			ИначеЕсли ТекСтрокаСписокСчетов.ПериодичностьВыплат = Перечисления.уп_ПериодичностьВыплат.Ежемесячно Тогда
				лДатаОкончанияСрочнойВыплаты = ДобавитьМесяц(НачалоМесяца(ТекСтрокаСписокСчетов.НачальнаяДата),ТекСтрокаСписокСчетов.КоличествоВыплат)-1;	
			КонецЕсли;
			Движение.ДатаОкончанияСрочнойВыплаты = лДатаОкончанияСрочнойВыплаты;
		КонецЕсли;
		//ОПА НПО 2018.06.14 -   
		
		//даты фиксации 
		//здесь есть вопросы - если назначение делается в январе-феврале, когда еще не распределяли ИД 
		//ставится будет только в 2023 году, далее записи в регистр будут делаться документом "Фиксация обязательств НПО"  
		//только надо будет проверку делать, была ли сделана фиксация на конец предыдущего года - это можно по дате фиксации определять
		Если Дата>'20230101' Тогда   
			//ДатаДвижений =Макс(ТекСтрокаСписокСчетов.НачальнаяДата, Дата) 
			//туту еще подумать на какую дату делать движения, если дата начала выплат уходит вперед на пару месяцев
			Если Дата>'20240101' Тогда
				Если ЗначениеЗаполнено(ТекСтрокаСписокСчетов.ДатаФиксации) И НачалоДня(ТекСтрокаСписокСчетов.ДатаФиксации)>=НачалоДня(НачалоГода(Дата)-1) Тогда
					//фиксация была сделана, можно ее не делать
					//тогда надо проверить, что дата следующей фиксации приходится на конец года
					Если ТекСтрокаСписокСчетов.ДатаСледующейФиксации>КонецГода(Дата) Тогда 
						Движение = Движения.уп_ДатаФиксацииОбязательствНПО.Добавить();
						Движение.НомерСчета = ТекСтрокаСписокСчетов.НомерСчета; 
						Движение.Период = Дата;
						Движение.ДатаФиксации = ТекСтрокаСписокСчетов.ДатаФиксации;
						Движение.ДатаНачалаПериодаФиксации = КонецДня(Дата)+1;
						Движение.ДатаСледующейФиксации = КонецГода(Дата); 
					КонецЕсли; 
				Иначе  
					//фиксации не было и ее надо сделать      
					//в этом случае дату следующей фиксации выставит документ фиксации
					//если есть чего фиксировать (если нечего, то будет входящая фиксация, она дату следующей фиксации поставит) 
					Если ТекСтрокаСписокСчетов.ИДКФиксацииОстаток <> 0 Тогда
						уп_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("По строке "+ТекСтрокаСписокСчетов.НомерСтроки+" не произведена фиксация обязательств перед перводом в выплатной период.",Отказ,Заголовок);
					Иначе
						Движение = Движения.уп_ДатаФиксацииОбязательствНПО.Добавить();
						Движение.НомерСчета = ТекСтрокаСписокСчетов.НомерСчета; 
						Движение.Период = Дата;
						Движение.ДатаФиксации = Дата;
						Движение.ДатаНачалаПериодаФиксации = КонецДня(Дата)+1;
						Движение.ДатаСледующейФиксации = КонецГода(Дата); 
					КонецЕсли;	
				КонецЕсли;
			Иначе  //здесь еще не было отрицательного ид, так что просто ставим следующую фиксацию на конец года  
				Если  ТекСтрокаСписокСчетов.ДатаЗаключения>='20230101' Тогда
					Движение = Движения.уп_ДатаФиксацииОбязательствНПО.Добавить();
					Движение.НомерСчета = ТекСтрокаСписокСчетов.НомерСчета; 
					Движение.Период = Дата;
					Движение.ДатаФиксации = ТекСтрокаСписокСчетов.ДатаФиксации;
					Движение.ДатаНачалаПериодаФиксации = Дата;
					Движение.ДатаСледующейФиксации = КонецГода(Дата); 
				КонецЕсли;	
			КонецЕсли; 
			Движение = Движения.уп_ПериодыГарантийногоВосполненияНПО.Добавить();
			Движение.Период = Дата;
			Движение.НомерСчета = ТекСтрокаСписокСчетов.НомерСчета;
			Движение.ПериодГарантийногоВосполнения = 1;
		КонецЕсли; 
		СуммаНаСчете = ТекСтрокаСписокСчетов.ВзносыНаИПС+ТекСтрокаСписокСчетов.ВзносыНаУК+
		ТекСтрокаСписокСчетов.ИДНаИПС + ТекСтрокаСписокСчетов.ИДНаУК;
		Если СуммаНаСчете = 0 и ТекСтрокаСписокСчетов.ВыделяемаяСумма = 0 и ТекСтрокаСписокСчетов.НомерСчета.Владелец.Вкладчик.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо Тогда 
			Если ТаблицаВыплатССПС.НайтиПоЗначению(ТекСтрокаСписокСчетов.НомерСчета.Владелец.ПенсионныйСчет)= Неопределено Тогда 
				НовСтрСПС = ТаблицаВыплатССПС.Добавить( ТекСтрокаСписокСчетов.НомерСчета.Владелец.ПенсионныйСчет);  
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;  
	Если Дата>'20230101' Тогда   
		Для а=0 по ТаблицаВыплатССПС.Количество()-1 Цикл  
			СчетСПС = ТаблицаВыплатССПС.Получить(а).Значение;
			ПериодыГарантийногоВосполнения = РегистрыСведений.уп_ПериодыГарантийногоВосполненияНПО.ПолучитьПоследнее(Дата, Новый Структура("НомерСчета", СчетСПС));
			
			Если НЕ ЗначениеЗаполнено(ПериодыГарантийногоВосполнения.ПериодГарантийногоВосполнения) 
				ИЛИ ПериодыГарантийногоВосполнения.ПериодГарантийногоВосполнения<>1 Тогда
				Движение = Движения.уп_ПериодыГарантийногоВосполненияНПО.Добавить();
				Движение.Период = Дата;
				Движение.НомерСчета = СчетСПС;
				Движение.ПериодГарантийногоВосполнения = 1; 
			КонецЕсли;
			
			ДатаПоследнейФиксации = РегистрыСведений.уп_ДатаФиксацииОбязательствНПО.ПолучитьПоследнее(Дата, Новый Структура("НомерСчета", СчетСПС));
			Если (ЗначениеЗаполнено(ДатаПоследнейФиксации.ДатаСледующейФиксации) 
				И КонецДня(ДатаПоследнейФиксации.ДатаСледующейФиксации)>КонецДня(КонецГода(Дата)))
				или НЕ ЗначениеЗаполнено(ДатаПоследнейФиксации.ДатаСледующейФиксации) Тогда
				Движение = Движения.уп_ДатаФиксацииОбязательствНПО.Добавить();
				Движение.НомерСчета = СчетСПС; 
				Движение.Период = Дата;
				Движение.ДатаФиксации = ДатаПоследнейФиксации.ДатаФиксации;
				Движение.ДатаНачалаПериодаФиксации = НачалоГода(Дата);
				Движение.ДатаСледующейФиксации = КонецГода(Дата);
			КонецЕсли;
		КонецЦикла;	 
	КонецЕсли;
	
	Если ВестиУчетПСпоТипамДоговоровЕПС Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	уп_РаспоряжениеСписокСчетов.НомерСчета КАК НомерСчета,
		|	уп_РаспоряжениеСписокСчетов.СхемаСчетаИсходная КАК СхемаСчетаИсходная,
		|	уп_РаспоряжениеСписокСчетов.Схема КАК Схема,
		|	уп_РаспоряжениеСписокСчетов.НачальнаяДата КАК НачальнаяДата,
		|	уп_РаспоряжениеСписокСчетов.ТипПенсии КАК ТипПенсии
		|ПОМЕСТИТЬ ТабСчетовДляПроверки
		|ИЗ
		|	Документ.уп_Распоряжение.СписокСчетов КАК уп_РаспоряжениеСписокСчетов
		|ГДЕ
		|	уп_РаспоряжениеСписокСчетов.Ссылка = &Ссылка
		|	И (уп_РаспоряжениеСписокСчетов.СхемаСчетаИсходная <> уп_РаспоряжениеСписокСчетов.Схема
		|	ИЛИ уп_РаспоряжениеСписокСчетов.СхемаСчетаИсходная.ТипПенсионнойСхемы = ЗНАЧЕНИЕ(Перечисление.уп_ТипыПенсионныхСхем.Смешанная))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	уп_ТипыПенсионныхСчетовДляЕПССрезПоследних.НомерСчета КАК НомерСчета,
		|	уп_ТипыПенсионныхСчетовДляЕПССрезПоследних.ТипДоговораЕПС КАК ТипДоговораЕПС
		|ПОМЕСТИТЬ ТипСчетовИсходный
		|ИЗ
		|	РегистрСведений.уп_ТипыПенсионныхСчетовДляЕПС.СрезПоследних(
		|			&ДатаДок,
		|			НомерСчета В
		|				(ВЫБРАТЬ
		|					ТабСчетовДляПроверки.НомерСчета
		|				ИЗ
		|					ТабСчетовДляПроверки)) КАК уп_ТипыПенсионныхСчетовДляЕПССрезПоследних
		|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	уп_ТипыПенсионныхСчетовДляЕПССрезПоследних.Объект КАК НомерСчета,
		//|	уп_ТипыПенсионныхСчетовДляЕПССрезПоследних.Значение КАК ТипДоговораЕПС
		//|ПОМЕСТИТЬ ТипСчетовИсходныйЕПС
		//|ИЗ
		//|	РегистрСведений.уп_ДопСведенияДляТрансляции.СрезПоследних(
		//|			&ДатаДок,  
		//|           Свойство = ЗНАЧЕНИЕ(ПланвидовХарактеристик.уп_ДополнительныеСведенияСРегистратором.ТипДоговораНПО_ЕПС) 
		//|			И Объект В
		//|				(ВЫБРАТЬ
		//|					ТабСчетовДляПроверки.НомерСчета
		//|				ИЗ
		//|					ТабСчетовДляПроверки)) КАК уп_ТипыПенсионныхСчетовДляЕПССрезПоследних
		//|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	уп_ПравилаПереходовТиповПенсионныхСчетовДляЕПССрезПоследних.ПенсионнаяСхема КАК ПенсионнаяСхема,
		|	уп_ПравилаПереходовТиповПенсионныхСчетовДляЕПССрезПоследних.ТипДоговораЕПС КАК ТипДоговораЕПС,
		|	уп_ПравилаПереходовТиповПенсионныхСчетовДляЕПССрезПоследних.ТипПенсии КАК ТипПенсии
		|ПОМЕСТИТЬ ТипыПоСхемам
		|ИЗ
		|	РегистрСведений.уп_ПравилаПереходовТиповПенсионныхСчетовДляЕПС.СрезПоследних(&ДатаДок, ) КАК уп_ПравилаПереходовТиповПенсионныхСчетовДляЕПССрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	уп_ИсключенияИзПравилПереходовДляЕПССрезПоследних.НомерСчета КАК НомерСчета,
		|	уп_ИсключенияИзПравилПереходовДляЕПССрезПоследних.Исключение КАК Исключение
		|ПОМЕСТИТЬ Исключаемые
		|ИЗ
		|	РегистрСведений.уп_ИсключенияИзПравилПереходовДляЕПС.СрезПоследних(
		|			&ДатаДок,
		|			НомерСчета В
		|				(ВЫБРАТЬ
		|					ТабСчетовДляПроверки.НомерСчета
		|				ИЗ
		|					ТабСчетовДляПроверки)) КАК уп_ИсключенияИзПравилПереходовДляЕПССрезПоследних
		|ГДЕ
		|	уп_ИсключенияИзПравилПереходовДляЕПССрезПоследних.Исключение = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТабСчетовДляПроверки.НомерСчета КАК НомерСчета,
		|	ТабСчетовДляПроверки.СхемаСчетаИсходная КАК СхемаСчетаИсходная,
		|	ТабСчетовДляПроверки.Схема КАК Схема,
		|	ЕСТЬNULL(ТипСчетовИсходный.ТипДоговораЕПС, &ПустойТипДоговора) КАК ТипДоговораЕПС,
		//|	ЕСТЬNULL(ТипСчетовИсходныйЕПС.ТипДоговораЕПС, &ПустойТипДоговора) КАК ТипДоговораЕПС,
		|	ЕСТЬNULL(ТипыПоСхемам.ТипДоговораЕПС, &ПустойТипДоговора) КАК ТипДоговораЕПСКонечный,  
		|	ЕСТЬNULL(Исключаемые.Исключение, ЛОЖЬ) КАК Исключение,
		|	ТабСчетовДляПроверки.НачальнаяДата КАК НачальнаяДата,
		|	ТабСчетовДляПроверки.ТипПенсии КАК ТипПенсии
		|ПОМЕСТИТЬ ПолнаяТаблица
		|ИЗ
		|	ТабСчетовДляПроверки КАК ТабСчетовДляПроверки
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТипСчетовИсходный КАК ТипСчетовИсходный
		|		ПО ТабСчетовДляПроверки.НомерСчета = ТипСчетовИсходный.НомерСчета
		//|		ЛЕВОЕ СОЕДИНЕНИЕ ТипСчетовИсходныйЕПС КАК ТипСчетовИсходныйЕПС
		//|		ПО ТабСчетовДляПроверки.НомерСчета = ТипСчетовИсходныйЕПС.НомерСчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТипыПоСхемам КАК ТипыПоСхемам
		|		ПО ТабСчетовДляПроверки.Схема = ТипыПоСхемам.ПенсионнаяСхема
		|			И (ВЫБОР
		|				КОГДА ТабСчетовДляПроверки.Схема.ТипПенсионнойСхемы = ЗНАЧЕНИЕ(Перечисление.уп_ТипыПенсионныхСхем.Смешанная)
		|					ТОГДА ТабСчетовДляПроверки.ТипПенсии = ТипыПоСхемам.ТипПенсии
		|				ИНАЧЕ 1 = 1
		|			КОНЕЦ)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Исключаемые КАК Исключаемые
		|		ПО ТабСчетовДляПроверки.НомерСчета = Исключаемые.НомерСчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПолнаяТаблица.НомерСчета КАК НомерСчета,
		|	ПолнаяТаблица.СхемаСчетаИсходная КАК СхемаСчетаИсходная,
		|	ПолнаяТаблица.Схема КАК Схема,
		|	ПолнаяТаблица.ТипДоговораЕПС КАК ТипДоговораЕПС,
		|	ПолнаяТаблица.ТипДоговораЕПСКонечный КАК ТипДоговораЕПСКонечный,
		|	ПолнаяТаблица.НачальнаяДата КАК НачальнаяДата,
		|	ПолнаяТаблица.ТипПенсии КАК ТипПенсии
		|ИЗ
		|	ПолнаяТаблица КАК ПолнаяТаблица
		|ГДЕ
		|	ПолнаяТаблица.ТипДоговораЕПС <> ПолнаяТаблица.ТипДоговораЕПСКонечный
		|	И ПолнаяТаблица.Исключение = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ТабСчетовДляПроверки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ТипСчетовИсходный
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ТипыПоСхемам
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ Исключаемые";
	
		Запрос.УстановитьПараметр("ДатаДок", Дата-1);
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.УстановитьПараметр("ПустойТипДоговора", Перечисления.нфо_ТипДоговораНПФ.ПустаяСсылка());
	
		РезультатЗапроса = Запрос.Выполнить();
	
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если НЕ (ВыборкаДетальныеЗаписи.ТипДоговораЕПС=Перечисления.нфо_ТипДоговораНПФ.Страховой
				И ВыборкаДетальныеЗаписи.ТипДоговораЕПСКонечный=Перечисления.нфо_ТипДоговораНПФ.Инвестиционный) Тогда
				Движение = Движения.уп_ТипыПенсионныхСчетовДляЕПС.Добавить();
				Движение.Период = ВыборкаДетальныеЗаписи.НачальнаяДата;
				Движение.НомерСчета = ВыборкаДетальныеЗаписи.НомерСчета;
				Движение.ТипДоговораЕПС = ВыборкаДетальныеЗаписи.ТипДоговораЕПСКонечный;  
				
				Движение = Движения.уп_ДопСведенияДляТрансляции.Добавить();
				Движение.Период = ВыборкаДетальныеЗаписи.НачальнаяДата;
				Движение.Объект = ВыборкаДетальныеЗаписи.НомерСчета;
				Движение.Свойство = ПланыВидовХарактеристик.уп_ДополнительныеСведенияСРегистратором.ТипДоговораНПО_ЕПС;
				Движение.Значение = ВыборкаДетальныеЗаписи.ТипДоговораЕПСКонечный;  
				
				Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ТипДоговораЕПС)
					и ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ТипДоговораЕПСКонечный) Тогда
					СтрокаТаблицыСчетов = ТаблицаСчетов.Добавить();
					СтрокаТаблицыСчетов.НомерСчета = ТекСтрокаСписокСчетов.НомерСчета;
					СтрокаТаблицыСчетов.ТипПССписания = ВыборкаДетальныеЗаписи.ТипДоговораЕПС;
					СтрокаТаблицыСчетов.ТипПСЗачисления = ВыборкаДетальныеЗаписи.ТипДоговораЕПСКонечный;
					СтрокаТаблицыСчетов.СхемаСписания = ВыборкаДетальныеЗаписи.СхемаСчетаИсходная;
					СтрокаТаблицыСчетов.СхемаЗачисления = ВыборкаДетальныеЗаписи.Схема;
					СтрокаТаблицыСчетов.ТипПенсии = ВыборкаДетальныеЗаписи.ТипПенсии;
				Иначе
					Если НЕ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ТипДоговораЕПС) Тогда
						Сообщить("По пенсионному счету "+ВыборкаДетальныеЗаписи.НомерСчета+" не указан исходный тип счета для ЕПС.");
						МассивСообщений.Добавить("По пенсионному счету "+ВыборкаДетальныеЗаписи.НомерСчета+" не указан исходный тип счета для ЕПС.");
					КонецЕсли;
					Если НЕ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ТипДоговораЕПСКонечный) Тогда
						Сообщить("По пенсионной схеме "+ВыборкаДетальныеЗаписи.Схема+" не указан тип счета для ЕПС.");
						МассивСообщений.Добавить("По пенсионной схеме "+ВыборкаДетальныеЗаписи.Схема+" не указан тип счета для ЕПС.");
					КонецЕсли;
				КонецЕсли;
			Иначе
				Сообщить("По пенсионному счету "+ТекСтрокаСписокСчетов.НомерСчета+" переклассификация в инвестиционный тип невозможна. Тип ЕПС остается прежним = Страховой.");
				МассивСообщений.Добавить("По пенсионному счету "+ТекСтрокаСписокСчетов.НомерСчета+" переклассификация в инвестиционный тип невозможна. Тип ЕПС остается прежним = Страховой.")
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;	//если ВестиУчетПоДоговорамЕПС
		
	НастройкаОпределенияКоличестваВыплат = РегистрыСведений.уп_ПенсионныеПравила.ПолучитьПоследнее(Дата, Новый Структура("Организация", Организация)).ОпределениеКоличестваВыплат;
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Дата", НачалоМесяца(Дата)-1);
	Запрос.Текст = "ВЫБРАТЬ
	               |	РаспоряжениеСписокСчетов.НачальнаяДата КАК НачальнаяДата,
	               |	РаспоряжениеСписокСчетов.НомерСчета КАК НомерСчета,
	               |	РаспоряжениеСписокСчетов.Схема КАК Схема,
	               |	РаспоряжениеСписокСчетов.ВыделяемаяСумма КАК ВыделяемаяСумма,
	               |	РаспоряжениеСписокСчетов.КоличествоВыплат КАК КоличествоВыплат
	               |ПОМЕСТИТЬ вр_списоксчетов
	               |ИЗ
	               |	Документ.уп_Распоряжение.СписокСчетов КАК РаспоряжениеСписокСчетов
	               |ГДЕ
	               |	РаспоряжениеСписокСчетов.Ссылка = &Ссылка
	               |	И (РаспоряжениеСписокСчетов.Схема.ТипПенсионнойСхемы = ЗНАЧЕНИЕ(Перечисление.уп_ТипыПенсионныхСхем.СрочныхВыплат)
	               |	ИЛИ РаспоряжениеСписокСчетов.ТипПенсии = ЗНАЧЕНИЕ(Перечисление.уп_ТипыПенсионныхСхем.СрочныхВыплат))
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
#Вставка
//++https://redmine.npf.com/issues/4274
	|ВЫБРАТЬ
	|	уп_СчетчикНачислений.НомерСчета КАК НомерСчета,
	|	МАКСИМУМ(ЕСТЬNULL(хм_СрезСчетчик.Количество, 0)) + СУММА(ВЫБОР
	|			КОГДА хм_СрезСчетчик.ДатаУстановкиСостояния ЕСТЬ NULL
	|				ТОГДА ЕСТЬNULL(уп_СчетчикНачислений.Количество, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоОборот
	|ПОМЕСТИТЬ уп_СчетчикНачисленийОбороты
	|ИЗ
	|	РегистрНакопления.уп_СчетчикНачислений КАК уп_СчетчикНачислений
	|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрСведений.хм_СрезСчетчикНачисленийНПО.СрезПоследних(&Дата,НомерСчета В (ВЫБРАТЬ
	|						вр.НомерСчета
	|					ИЗ
	|						вр_списоксчетов КАК вр)) КАК хм_СрезСчетчик
	|		ПО (уп_СчетчикНачислений.НомерСчета = хм_СрезСчетчик.НомерСчета)
	|			И уп_СчетчикНачислений.Период < хм_СрезСчетчик.ДатаУстановкиСостояния 
	|			И хм_СрезСчетчик.ДатаУстановкиСостояния  >= ДАТАВРЕМЯ(1980, 1, 1)	
	|		ГДЕ уп_СчетчикНачислений.Период <= &Дата 
	|			И уп_СчетчикНачислений.Период >= ДАТАВРЕМЯ(1980, 1, 1)
	|			И уп_СчетчикНачислений.НомерСчета В (ВЫБРАТЬ
	|						вр.НомерСчета
	|					ИЗ
	|						вр_списоксчетов КАК вр)
	|		СГРУППИРОВАТЬ ПО уп_СчетчикНачислений.НомерСчета
	|ИНДЕКСИРОВАТЬ ПО
	|	НомерСчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
//--https://redmine.npf.com/issues/4274
#КонецВставки
	               |ВЫБРАТЬ
	               |	вр_списоксчетов.НачальнаяДата КАК НачальнаяДата,
	               |	вр_списоксчетов.НомерСчета КАК НомерСчета,
	               |	вр_списоксчетов.КоличествоВыплат КАК КоличествоВыплат,
	               |	вр_списоксчетов.КоличествоВыплат + ЕСТЬNULL(уп_СчетчикНачисленийОбороты.КоличествоОборот, 0) КАК КоличествоНазначенныхВыплат
	               |ИЗ
	               |	вр_списоксчетов КАК вр_списоксчетов
#Вставка
//++https://redmine.npf.com/issues/4274
	|		ЛЕВОЕ СОЕДИНЕНИЕ уп_СчетчикНачисленийОбороты КАК уп_СчетчикНачисленийОбороты
//--https://redmine.npf.com/issues/4274
#КонецВставки
#Удаление
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.уп_СчетчикНачислений.Обороты(
	               |				ДАТАВРЕМЯ(1980, 1, 1),
	               |				&Дата,
	               |				,
	               |				НомерСчета В
	               |					(ВЫБРАТЬ
	               |						вр.НомерСчета
	               |					ИЗ
	               |						вр_списоксчетов КАК вр)) КАК уп_СчетчикНачисленийОбороты
#КонецУдаления
	               |		ПО вр_списоксчетов.НомерСчета = уп_СчетчикНачисленийОбороты.НомерСчета";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Движение = Движения.уп_КоличествоВыплат.Добавить();
		Движение.Период = Выборка.НачальнаяДата;
		Движение.НомерСчета = Выборка.НомерСчета;
		Движение.КоличествоВыплат = Выборка.КоличествоВыплат;
		
		Если НастройкаОпределенияКоличестваВыплат Тогда
			КоличествоНазначенныхВыплат = Выборка.КоличествоНазначенныхВыплат;
		Иначе
			УжеНазначено = РегистрыСведений.уп_КоличествоНазначенныхВыплат.ПолучитьПоследнее(Выборка.НачальнаяДата-1, Новый Структура("НомерСчета", Выборка.НомерСчета));
			Если УжеНазначено <> Неопределено Тогда
				КоличествоНазначенныхВыплат = УжеНазначено.КоличествоВыплат + Выборка.КоличествоВыплат;
			Иначе
				КоличествоНазначенныхВыплат = Выборка.КоличествоВыплат;
			КонецЕсли;	
		КонецЕсли;
		
		Движение = Движения.уп_КоличествоНазначенныхВыплат.Добавить();
		Движение.Период = Выборка.НачальнаяДата;
		Движение.НомерСчета = Выборка.НомерСчета;
		Движение.КоличествоВыплат = КоличествоНазначенныхВыплат;
	КонецЦикла; 
	
	ТабДоверенныхЛиц = СписокСчетов.Выгрузить();
	ТабДоверенныхЛиц.Свернуть("Участник, ДоверенноеЛицо, НачальнаяДата", "ВыделяемаяСумма");
	Для Каждого СтрокаДЛ Из ТабДоверенныхЛиц Цикл
		Движение = Движения.уп_ДоверенныеЛицаУчастников.Добавить();
		Движение.Период = СтрокаДЛ.НачальнаяДата;
		Движение.Участник = СтрокаДЛ.Участник;
		Движение.ДоверенноеЛицо = СтрокаДЛ.ДоверенноеЛицо;
	КонецЦикла;	
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("НомерСчета");
	ТЗ.Колонки.Добавить("ТипСчетаНач");
	ТЗ.Колонки.Добавить("ТипСчетаКон");
	
	СписокСчетовДоговора = Новый СписокЗначений;
	//ОПА НПО 2018.04.28 +
	СписокСчетовИсключений = Новый СписокЗначений;	
	//ОПА НПО 2018.04.28 -
	//Запрос по резервам на перевод средств
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РезервыОстатки.НомерСчета КАК НомерСчета,
	               |	РезервыОстатки.ТипРезерва КАК ТипРезерва,
	               |	РезервыОстатки.ТипСуммы КАК ТипСуммы,
	               |	РезервыОстатки.СуммаОстаток КАК СуммаОстаток,
	               |	РезервыОстатки.ПенсионнаяСхема КАК ПенсионнаяСхемаВРегистре,
	               |	ВложенныйЗапрос.Схема КАК Схема,
	               |	СхемаСчетаСрезПоследних.Схема КАК СхемаСтарая,
	               |	ЕСТЬNULL(СтартовыеСуммыСрезПоследних.Сумма, 0) КАК СтартоваяСумма,
	               |	ВложенныйЗапрос.ВыделяемаяСумма КАК ВыделяемаяСумма,
	               |	ВложенныйЗапрос.ТипПенсии КАК ТипПенсии
	               |ИЗ
	               |	РегистрНакопления.уп_Резервы.Остатки(
	               |			&ДатаОстатков,
	               |			НомерСчета В (&СписокПС)
	               |				И Организация = &Организация) КАК РезервыОстатки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			РаспоряжениеСписокСчетов.НомерСчета КАК НомерСчета,
	               |			РаспоряжениеСписокСчетов.Схема КАК Схема,
	               |			РаспоряжениеСписокСчетов.ВыделяемаяСумма КАК ВыделяемаяСумма,
	               |			РаспоряжениеСписокСчетов.ТипПенсии КАК ТипПенсии
	               |		ИЗ
	               |			Документ.уп_Распоряжение.СписокСчетов КАК РаспоряжениеСписокСчетов
	               |		ГДЕ
	               |			РаспоряжениеСписокСчетов.Ссылка = &Ссылка) КАК ВложенныйЗапрос
	               |		ПО (ВложенныйЗапрос.НомерСчета = РезервыОстатки.НомерСчета)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уп_СхемаСчета.СрезПоследних(&ДатаДляСхемы, НомерСчета В (&СписокПС)) КАК СхемаСчетаСрезПоследних
	               |		ПО РезервыОстатки.НомерСчета = СхемаСчетаСрезПоследних.НомерСчета
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уп_СтартовыеСуммы.СрезПоследних(&ДатаДляСхемы, НомерСчета В (&СписокПС)) КАК СтартовыеСуммыСрезПоследних
	               |		ПО РезервыОстатки.НомерСчета = СтартовыеСуммыСрезПоследних.НомерСчета
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	НомерСчета
	               |ИТОГИ
	               |	СУММА(СуммаОстаток)
	               |ПО
	               |	НомерСчета";
	
	Запрос.УстановитьПараметр("ДатаОстатков", Дата);
	Запрос.УстановитьПараметр("ДатаДляСхемы", Дата-1);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("СписокПС", СписокСчетов.ВыгрузитьКолонку("НомерСчета"));
	
	Результат = Запрос.Выполнить();
	ВыборкаГрупп = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаГрупп.Следующий() Цикл
		Выборка = ВыборкаГрупп.Выбрать();
		ТекВыделяемаяСумма = 0;
		Пока Выборка.Следующий() Цикл
			ТекВыделяемаяСумма = Выборка.ВыделяемаяСумма;
			НадоПереводить = Ложь;
			КонТипРезерва = уп_ОбщегоНазначенияУчетРезервов.ОпределитьКонечныйТипРезерва(Выборка.Схема, Выборка.ТипРезерва, Выборка.ТипПенсии);
			Если КонТипРезерва<>Выборка.ТипРезерва Тогда
				НадоПереводить = Истина;
			Конецесли;
			Если ВестиУчетПоСхемам и (Выборка.Схема <> Выборка.СхемаСтарая) Тогда
				НадоПереводить = Истина;
			КонецЕсли;	
			Если (КонТипРезерва = Перечисления.уп_ТипыРезерва.ПожизненныхВыплат) 
				и (Выборка.НомерСчета.Владелец.Вкладчик.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо) Тогда
				ПорядокВеденияПожизненногоРезерва = уп_НПФ.ОпределитьПорядокВеденияПожизненногоРезерва(Выборка.Схема, Дата);
				
				Если ПорядокВеденияПожизненногоРезерва = Перечисления.уп_РезервПожизненныхВыплат.ПоДоговорам Тогда
					НадоПереводить = Истина;
					
					Если СписокСчетовДоговора.НайтиПоЗначению(Выборка.НомерСчета.Владелец.ПенсионныйСчет) = Неопределено Тогда
						СписокСчетовДоговора.Добавить(Выборка.НомерСчета.Владелец.ПенсионныйСчет);
					КонецЕсли;
				ИначеЕсли ПорядокВеденияПожизненногоРезерва = Перечисления.уп_РезервПожизненныхВыплат.БезАналитики Тогда
					НадоПереводить = Истина;
					
				КонецЕсли;
			ИначеЕсли (КонТипРезерва = Перечисления.уп_ТипыРезерва.ПожизненныхВыплат) 
				и (Выборка.НомерСчета.Владелец.Вкладчик.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо) Тогда
				ПорядокВеденияПожизненногоРезерва = уп_НПФ.ОпределитьПорядокВеденияПожизненногоРезерва(Выборка.Схема, Дата);
				Если ПорядокВеденияПожизненногоРезерва = Перечисления.уп_РезервПожизненныхВыплат.БезАналитики Тогда
					НадоПереводить = Истина;
				КонецЕсли;
			КонецЕсли;
			
			Если НадоПереводить Тогда
				//ОПА НПО 2018.04.28 +
				СписокСчетовИсключений.Добавить(Выборка.НомерСчета);
				//ОПА НПО 2018.04.28 -
				//движения по резервам
				//ПереводСредств(КонТипРезерва, Выборка.НомерСчета, Выборка.ТипРезерва, Выборка.ТипСуммы, Выборка.СуммаОстаток, Выборка.Схема, Выборка.ТипПенсии, Выборка.СхемаСтарая, Отказ);
				ПереводСредств(КонТипРезерва, Выборка.НомерСчета, Выборка.ТипРезерва, Выборка.ТипСуммы, Выборка.СуммаОстаток, Выборка.Схема, Выборка.ТипПенсии, Выборка.ПенсионнаяСхемаВРегистре, Отказ);
			КонецЕсли;
		КонецЦикла;
		
		//стартовые суммы
		Движение = Движения.уп_СтартовыеСуммы.Добавить();
		Движение.Период = Дата;
		Движение.НомерСчета = ВыборкаГрупп.НомерСчета;
		Движение.Сумма = ВыборкаГрупп.СуммаОстаток+ТекВыделяемаяСумма;
	КонецЦикла;
	
	//если с солидарного счета выделяются суммы, то их надо выделить, а затем перевести
	//1) Выделяем суммы
	//проверим, есть ли распределяемая сумма на счете
	СписокВозврата = Проверка(Заголовок);
	ОтказПоСумме = СписокВозврата.Получить(0).Значение;
	Если Списоксчетов.Итог("ВыделяемаяСумма")<>0 Тогда
		Если Не ОтказПоСумме Тогда
			ТаблицаОстатков = СписокВозврата.Получить(1).Значение;
			ДвиженияПоВыделеннымСуммам(ТаблицаОстатков, ТЗ, СписокСчетовДоговора);
		КонецЕсли;
	КонецЕсли;
	
	//определим типы пенсионных счетов табличной части
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ПенсионныеСчета.НомерСчета,
	|	ВидПенсионногоСчетаСрезПоследних.ВидПенсионногоСчета
	|ИЗ
	|	(ВЫБРАТЬ
	|		РаспоряжениеСписокСчетов.НомерСчета КАК НомерСчета
	|	ИЗ
	|		Документ.уп_Распоряжение.СписокСчетов КАК РаспоряжениеСписокСчетов
	|	ГДЕ
	|		РаспоряжениеСписокСчетов.Ссылка = &Ссылка
	|		И РаспоряжениеСписокСчетов.ВыделяемаяСумма <> 0) КАК ПенсионныеСчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уп_ВидПенсионногоСчета.СрезПоследних(&ДатаДок, НомерСчета В (&СписокСчетов)) КАК ВидПенсионногоСчетаСрезПоследних
	|		ПО ПенсионныеСчета.НомерСчета = ВидПенсионногоСчетаСрезПоследних.НомерСчета";
	
	Запрос.УстановитьПараметр("ДатаДок", Дата-1);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("СписокСчетов", СписокСчетов.ВыгрузитьКолонку("НомерСчета"));
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.ВидПенсионногоСчета<>ВидПенсионногоСчета Тогда	
			СтрокаТЗ = ТЗ.Найти(Выборка.НомерСчета,"НомерСчета");
			Если СтрокаТЗ = Неопределено Тогда
				НовСтрТЗ = ТЗ.Добавить();
				НовСтрТЗ.НомерСчета = Выборка.НомерСчета;
				НовСтрТЗ.ТипСчетаНач = Выборка.ВидПенсионногоСчета;
				НовСтрТЗ.ТипСчетаКон = ВидПенсионногоСчета;
			КонецЕсли;
		Конецесли;
	КонецЦикла;
	
	//вид пенсионного счета
	Для каждого стр из ТЗ Цикл
		Движение = Движения.уп_ВидПенсионногоСчета.Добавить();
		Движение.Период = Дата;
		Движение.НомерСчета = стр.НомерСчета;
		Движение.ВидПенсионногоСчета = стр.ТипСчетаКон;
	КонецЦикла;
	
	//если деньги были переведены на счет договора, то надо проверить находится ли он в выплатном периоде
	//и проставлена ли у него схема
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	НомераСчетов.НомерСчета,
	|	СостоянияПССрезПоследних.Состояние,
	|	СхемаСчетаСрезПоследних.Схема
	|ИЗ
	|	(ВЫБРАТЬ
	|		ПенсионныеСчета.Ссылка КАК НомерСчета
	|	ИЗ
	|		Справочник.уп_ПенсионныеСчета КАК ПенсионныеСчета
	|	ГДЕ
	|		ПенсионныеСчета.Ссылка В(&СписокСчетов)) КАК НомераСчетов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уп_СостоянияПС.СрезПоследних(&Дата, НомерСчета В (&СписокСчетов)) КАК СостоянияПССрезПоследних
	|		ПО НомераСчетов.НомерСчета = СостоянияПССрезПоследних.НомерСчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уп_СхемаСчета.СрезПоследних(&Дата, НомерСчета В (&СписокСчетов)) КАК СхемаСчетаСрезПоследних
	|		ПО НомераСчетов.НомерСчета = СхемаСчетаСрезПоследних.НомерСчета";
	
	Запрос.УстановитьПараметр("СписокСчетов", СписокСчетовДоговора);
	Запрос.УстановитьПараметр("Дата", Дата);
	
	ТабСчетовДоговора = Запрос.Выполнить().Выгрузить();
	
	Для а=1 по СписокСчетовДоговора.Количество() Цикл
		НомерСчетаДоговора = СписокСчетовДоговора.Получить(а-1).Значение;
		СтрТаб = ТабСчетовДоговора.Найти(НомерСчетаДоговора,"НомерСчета");
		Если стрТаб.Состояние<>Перечисления.уп_СостоянияПС.ВыплатнойПериод Тогда
			// регистр СостоянияПС 
			Движение = Движения.уп_СостоянияПС.Добавить();
			Движение.Период = Дата;
			Движение.НомерСчета = НомерСчетаДоговора;
			Движение.Состояние = Перечисления.уп_СостоянияПС.ВыплатнойПериод;
		КонецЕсли;
	КонецЦикла;
	
	Если ВестиУчетПСпоТипамДоговоровЕПС Тогда
		//ОПА НПО 2018.04.28 +
		//регистр РезервыНПО
		ТаблицаСчетов.Свернуть("НомерСчета,ТипПССписания,ТипПСЗачисления,СхемаСписания,СхемаЗачисления, ТипПенсии");
		Если ТаблицаСчетов.Количество() > 0 Тогда
			Запрос = Новый Запрос();
			Запрос.Текст = "ВЫБРАТЬ
			|	ТаблицаСчетов.НомерСчета КАК НомерСчета,
			|	ТаблицаСчетов.ТипПССписания КАК ТипПССписания,
			|	ТаблицаСчетов.ТипПСЗачисления КАК ТипПСЗачисления,
			|	ТаблицаСчетов.СхемаСписания КАК СхемаСписания,
			|	ТаблицаСчетов.СхемаЗачисления КАК СхемаЗачисления,
			|	ТаблицаСчетов.ТипПенсии КАК ТипПенсии
			|ПОМЕСТИТЬ ВТ_ТаблицаСчетов
			|ИЗ
			|	&ТаблицаСчетов КАК ТаблицаСчетов
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_ТаблицаСчетов.НомерСчета КАК НомерСчета,
			|	ВТ_ТаблицаСчетов.ТипПССписания КАК ТипПССписания,
			|	ВТ_ТаблицаСчетов.ТипПСЗачисления КАК ТипПСЗачисления,
			|	ВТ_ТаблицаСчетов.СхемаСписания КАК СхемаСписания,
			|	ВТ_ТаблицаСчетов.СхемаЗачисления КАК СхемаЗачисления,
			|	ВТ_ТаблицаСчетов.ТипПенсии КАК ТипПенсии,
			|	уп_РезервыОстатки.Организация КАК Организация,
			|	уп_РезервыОстатки.ТипРезерва КАК ТипРезерва,
			|	уп_РезервыОстатки.ТипСуммы КАК ТипСуммы,
			|	уп_РезервыОстатки.ПенсионнаяСхема КАК ПенсионнаяСхема,
			|	уп_РезервыОстатки.СуммаОстаток КАК Сумма
			|ИЗ
			|	ВТ_ТаблицаСчетов КАК ВТ_ТаблицаСчетов
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.уп_Резервы.Остатки(
			|				&КонецПериода,
			|				НомерСчета В (&СписокСчетов)
			|					И НЕ НомерСчета В (&СписокСчетовИсключений)) КАК уп_РезервыОстатки
			|		ПО ВТ_ТаблицаСчетов.НомерСчета = уп_РезервыОстатки.НомерСчета";
			
			Запрос.УстановитьПараметр("ТаблицаСчетов", ТаблицаСчетов);
			Запрос.УстановитьПараметр("КонецПериода", Дата);
			Запрос.УстановитьПараметр("СписокСчетов", ТаблицаСчетов.ВыгрузитьКолонку("НомерСчета"));
			Запрос.УстановитьПараметр("СписокСчетовИсключений", СписокСчетовИсключений);
			
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				Если Выборка.ТипПССписания = Перечисления.нфо_ТипДоговораНПФ.Инвестиционный Тогда
					Если Выборка.ТипПСЗачисления = Перечисления.нфо_ТипДоговораНПФ.Страховой Тогда
						лВидДвиженияПоТипамЕПС = Перечисления.уп_ВидыДвиженийПоТипамЕПС.Инвестиционный_Страховой;		
					КонецЕсли;	
				ИначеЕсли Выборка.ТипПССписания = Перечисления.нфо_ТипДоговораНПФ.Страховой Тогда
					Если Выборка.ТипПСЗачисления = Перечисления.нфо_ТипДоговораНПФ.Инвестиционный Тогда
						//лВидДвиженияПоТипамЕПС = Перечисления.уп_ВидыДвиженийПоТипамЕПС.Страховой_Инвестиционный;
						лВидДвиженияПоТипамЕПС = Перечисления.уп_ВидыДвиженийПоТипамЕПС.Страховой_Страховой;
						//Сообщить("По пенсионному счету "+Выборка.НомерСчета+" переклассификация в инвестиционный тип невозможна. Тип ЕПС остается прежним = Страховой.");
						//МассивСообщений.Добавить("По пенсионному счету "+Выборка.НомерСчета+" переклассификация в инвестиционный тип невозможна. Тип ЕПС остается прежним = Страховой.")
					КонецЕсли;	
				КонецЕсли;
				
				//Движение = Движения.уп_Резервы.ДобавитьРасход();
				//ЗаполнитьЗначенияСвойств(Движение,Выборка);
				//Движение.Период = Дата;
				//Движение.Регистратор = Ссылка;
				//Движение.ВидДвиженияПоТипамЕПС = лВидДвиженияПоТипамЕПС;
				//Движение.ПенсионныйСчетИсточник = Выборка.НомерСчета;
				//Движение.Схема = Выборка.СхемаСписания;
				//
				//Движение = Движения.уп_Резервы.ДобавитьПриход();
				//ЗаполнитьЗначенияСвойств(Движение,Выборка);
				//Движение.Период = Дата;
				//Движение.Регистратор = Ссылка;
				//Движение.ВидДвиженияПоТипамЕПС = лВидДвиженияПоТипамЕПС;
				//Движение.ПенсионныйСчетИсточник = Выборка.НомерСчета;
				//Движение.Схема = Выборка.СхемаЗачисления;
				
				
				ПереводСредств(Выборка.ТипРезерва, Выборка.НомерСчета, Выборка.ТипРезерва, Выборка.ТипСуммы, Выборка.Сумма, Выборка.СхемаЗачисления, Выборка.ТипПенсии, Выборка.СхемаСписания, Отказ);
				
			КонецЦикла;
		КонецЕсли;
		//ОПА НПО 2018.04.28 -
	КонецЕсли; 
	
	Если ОтражатьВБухгалтерскомУчете Тогда
		уп_ОбщегоНазначенияУчетРезервов.ДополнитьТаблицуБухУчета(Дата, ТабБухУчет, Ссылка, Отказ);
		уп_ОбщегоНазначенияУчетРезервов.СделатьДвиженияПоБухУчету(ЭтотОбъект, ТабБухУчет);
	КонецЕсли;	 
	
	Если ЗначениеЗаполнено(Заявление) Тогда  
		Движение = Движения.уп_СостоянияЗаявленийНПО.Добавить();
		Движение.Период = Дата;
		Движение.Заявление = Заявление; 
		Если ТипЗнч(Заявление) = Тип("ДокументСсылка.уп_ЗаявлениеУчастникаОНазначенииПенсии") Тогда
			Движение.ТипЗаявления = Перечисления.уп_ТипыЗаявленийНПО.ВыплатаПенсии;
		Иначе 
			Движение.ТипЗаявления = Перечисления.уп_ТипыЗаявленийНПО.ИзменениеУсловийВыплаты;
		КонецЕсли;	
		Движение.Состояние = Перечисления.уп_СостоянияЗаявленийНПО.РешениеОВыплате;
		Движение.Регистратор = Ссылка;
	КонецЕсли;	
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;	
	ДополнительныеСвойства.Вставить("МассивСообщений", МассивСообщений);
	// записываем движения регистров
	// Молчанов начало
	//Движения.уп_СостоянияПС.Записать();
	//Движения.уп_ЛицевыеСчетаУчастников.Записать();
	Если ИзменениеУсловийВыплат Тогда
		Движения.уп_СостоянияПС.Очистить();
		Движения.уп_СостоянияПС.Записывать = Ложь;
	Иначе
		Движения.уп_СостоянияПС.Записать();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Заявление) Или ИзменениеУсловийВыплат Тогда
		Движения.уп_ЛицевыеСчетаУчастников.Очистить();
		Движения.уп_ЛицевыеСчетаУчастников.Записывать = Ложь;	
	Иначе
		Движения.уп_ЛицевыеСчетаУчастников.Записать();
	КонецЕсли;
	// Молчанов конец
	Движения.уп_РазмерПенсии.Записать();
	Движения.уп_ПериодичностьВыплат.Записать();
	Движения.уп_СхемаСчета.Записать();
	Движения.уп_КоличествоВыплат.Записать();
	Движения.уп_НомераОчередей.Записать();
	Движения.уп_ЛицевыеСчетаУчастников.Записать();
	Движения.уп_ВидПенсионногоСчета.Записать();
	Движения.уп_Резервы.Записать();
	Движения.Хозрасчетный.Записать();
	Движения.уп_СрокиПеререгистрации.Записать();
	Движения.уп_ТипыПенсионныхСчетовДляЕПС.Записать();	//ОПА НПО 2018.04.25 +-
	Движения.уп_ДатыСледующихВыплат.Записать();	//ОПА НПО 2018.04.25 +-
	Движения.уп_ДатыОкончанияСрочнойВыплаты.Записать();	//ОПА НПО 2018.04.25 +-
КонецПроцедуры
